# encoding: utf-8

class String
  RU_TRANSFORM =
  {
    'а' => 'А', 'А' => 'а',
    'б' => 'Б', 'Б' => 'б',
    'в' => 'В', 'В' => 'в',
    'г' => 'Г', 'Г' => 'г',
    'д' => 'Д', 'Д' => 'д',
    'е' => 'Е', 'Е' => 'е',
    'ё' => 'Ё', 'Ё' => 'ё',
    'ж' => 'Ж', 'Ж' => 'ж',
    'з' => 'З', 'З' => 'з',
    'и' => 'И', 'И' => 'и',
    'й' => 'Й', 'Й' => 'й',
    'к' => 'К', 'К' => 'к',
    'л' => 'Л', 'Л' => 'л',
    'м' => 'М', 'М' => 'м',
    'н' => 'Н', 'Н' => 'н',
    'о' => 'О', 'О' => 'о',
    'п' => 'П', 'П' => 'п',
    'р' => 'Р', 'Р' => 'р',
    'с' => 'С', 'С' => 'с',
    'т' => 'Т', 'Т' => 'т',
    'у' => 'У', 'У' => 'у',
    'ф' => 'Ф', 'Ф' => 'ф',
    'х' => 'Х', 'Х' => 'х',
    'ц' => 'Ц', 'Ц' => 'ц',
    'ч' => 'Ч', 'Ч' => 'ч',
    'ш' => 'Ш', 'Ш' => 'ш',
    'щ' => 'Щ', 'Щ' => 'щ',
    'ь' => 'Ь', 'Ь' => 'ь',
    'ы' => 'Ы', 'Ы' => 'ы',
    'ъ' => 'Ъ', 'Ъ' => 'ъ',
    'э' => 'Э', 'Э' => 'э',
    'ю' => 'Ю', 'Ю' => 'ю',
    'я' => 'Я', 'Я' => 'я'
  }
  
  alias :downcase_real :downcase
  def downcase
    cased = downcase_real
    cased.gsub(/([АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЬЫЪЭЮЯ])/) do |w|
      RU_TRANSFORM[w]
    end
  end
  
  alias :upcase_real :upcase
  def upcase
    cased = upcase_real
    cased.gsub(/([абвгдеёжзийклмнопрстуфхцчшщьыъэюя])/) do |w|
      RU_TRANSFORM[w]
    end
  end
end